## Data about DataFrame

In [1]:
import pandas as pd
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
#Create a DataFrame from a csv file

df  = pd.read_csv('../datasets/Default.csv',index_col=0)

In [3]:
# Easy way to find out number of rows & columns, data type of columns in a DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10000 entries, 1 to 10000
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   default  10000 non-null  object
 1   student  10000 non-null  object
 2   balance  10000 non-null  float64
 3   income   10000 non-null  float64
dtypes: float64(2), object(2)
memory usage: 390.6+ KB

In [4]:
#Want to know how many null values are there in DataFrame for each column(variable/feature)
df.isnull().sum()
#is same as
df.isna().sum()

default    0
student    0
balance    0
income     0
dtype: int64

default    0
student    0
balance    0
income     0
dtype: int64

In [5]:
#Explore few rows of data in the DataFrame

#df.head() returns first five rows of the DataFrame
df.head()
#df.tail() returns last five rows of the DataFrame
df.tail()

  default student      balance        income
1      No      No   729.526495  44361.625074
2      No     Yes   817.180407  12106.134700
3      No      No  1073.549164  31767.138947
4      No      No   529.250605  35704.493935
5      No      No   785.655883  38463.495879

      default student      balance        income
9996       No      No   711.555020  52992.378914
9997       No      No   757.962918  19660.721768
9998       No      No   845.411989  58636.156984
9999       No      No  1569.009053  36669.112365
10000      No     Yes   200.922183  16862.952321

In [9]:
#returns data type of each column in the DataFrame
df.dtypes

default     object
student     object
balance    float64
income     float64
dtype: object

## Descriptive statistics information of a DataFrame

In [6]:
df.describe()

            balance        income
count  10000.000000  10000.000000
mean     835.374886  33516.981876
std      483.714985  13336.639563
min        0.000000    771.967729
25%      481.731105  21340.462903
50%      823.636973  34552.644802
75%     1166.308386  43807.729272
max     2654.322576  73554.233495

In [7]:
#Count non NA cells in each row or column
df.count()

default    10000
student    10000
balance    10000
income     10000
dtype: int64

In [8]:
# returns min value for each column
df.min(axis=0)
# returns max value for each column
df.max(axis=0)

default            No
student            No
balance           0.0
income     771.967729
dtype: object

default             Yes
student             Yes
balance     2654.322576
income     73554.233495
dtype: object

In [10]:
df.median()

balance      823.636973
income     34552.644802
dtype: float64

In [11]:
df.mean()

balance      835.374886
income     33516.981876
dtype: float64

In [12]:
df.quantile()

balance      823.636973
income     34552.644802
Name: 0.5, dtype: float64